import React from 'react';

const TrashIcon = ({ fill, stroke, strokeWidth }) => {
  return (
    <svg
      id="trash_icon"
      width="2rem"
      height="2rem"
      xmlns="http://www.w3.org/2000/svg"
      viewBox="0 0 33.33 40"
      fill={fill}
      stroke={stroke}
      strokeWidth={strokeWidth}
    >
      <path
        id="trash_icon"
        data-name="패스 44"
        fill="none"
        d="M3.33,3.33H30a3.34,3.34,0,0,1,3.33,3.34V10H0V6.67A3.34,3.34,0,0,1,3.33,3.33Z"
      />
      <path
        id="trash_icon"
        data-name="패스 45"
        fill="none"
        d="M13.33,0H20a3.33,3.33,0,0,1,3.33,3.33v2H10v-2A3.33,3.33,0,0,1,13.33,0Z"
      />
      <path
        id="trash_icon"
        data-name="패스 46"
        d="M30,3.33H23.33A3.34,3.34,0,0,0,20,0H13.33A3.35,3.35,0,0,0,10,3.33H3.33A3.34,3.34,0,0,0,0,6.67V8a2,2,0,0,0,2,2H31.33a2,2,0,0,0,2-2V6.67A3.34,3.34,0,0,0,30,3.33ZM13.33,2H20a1.33,1.33,0,0,1,1.33,1.32H12A1.33,1.33,0,0,1,13.33,2Zm18,6H2V6.67A1.34,1.34,0,0,1,3.33,5.33H30a1.33,1.33,0,0,1,1.33,1.34Z"
      />
      <path
        id="trash_icon"
        data-name="패스 23"
        d="M28,12.87l-2,23.8A1.34,1.34,0,0,1,24.67,38h-16a1.34,1.34,0,0,1-1.34-1.33h0l-2-23.8a1,1,0,0,0-1-1h0a1,1,0,0,0-1,1l2,23.8A3.34,3.34,0,0,0,8.67,40h16A3.33,3.33,0,0,0,28,36.67l2-23.8a1,1,0,0,0-1-1h0A1,1,0,0,0,28,12.87Z"
      />
      <path
        id="trash_icon"
        data-name="사각형 31"
        d="M10.67,15.45h0a1,1,0,0,1,1,1.09l1,17.31a1.06,1.06,0,0,1-1,1.09h0a1,1,0,0,1-1-1.09l-1-17.31A1,1,0,0,1,10.67,15.45Z"
      />
      <path
        id="trash_icon"
        data-name="사각형 32"
        d="M16.67,15.45h0a1,1,0,0,1,1,1.09V33.85a1.06,1.06,0,0,1-1,1.09h0a1,1,0,0,1-1-1.09V16.54A1,1,0,0,1,16.67,15.45Z"
      />
      <path
        id="trash_icon"
        data-name="사각형 33"
        d="M22.67,15.45h0a1,1,0,0,1,1,1.09l-1,17.31a1.06,1.06,0,0,1-1,1.09h0a1,1,0,0,1-1-1.09l1-17.31A1,1,0,0,1,22.67,15.45Z"
      />
    </svg>
  );
};

export default TrashIcon;
